app/Http/Controllers/CartController.php

insert into `cart_photo` (`cart_id`, `photo_variation_id`) values (2, 2)
---
    public function save(Request $request)
    {
       // dd($request->all());
       $request->validate([
           'product_variation_id' => 'required'
       ]);

       $cart = \App\Models\Cart::firstOrCreate([
           'session_id'=> session()->getId()
       ]);

       $cart->PhotoVariations()->syncWithoutDetaching($request->product_variation_id);

select * from `carts` where `session_id` = 'ymNNXwsaslKVsW3uCWuqeNCGOp3LLnOhtTwMfIkW' limit 1
delete from `cart_photo` where `cart_id` = 2 and `photo_variation_id` in ('1')
---
    public function destroy(Request $request)
    {
        //dd($request->id);
        $cart = \App\MOdels\Cart::where('session_id',session()->getId())->first();

        $cart->PhotoVariations()->detach($request->id);