app/Http/Controllers/HomeController.php

select * from `photos`
---
    public function index()
    {
        $photos = \App\Models\Photo::all();