app/Providers/AppServiceProvider.php

    public function boot()
    {
       // dd(session()->getId());
       View::composer('*',function($view){
        $view->with('cart', \App\Models\Cart::where('session_id',session()->getId())->first());
---
select * from `carts` where `session_id` = 'ymNNXwsaslKVsW3uCWuqeNCGOp3LLnOhtTwMfIkW' limit 1